Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/xdmac.h
#define   XDMAC_CC_PERID_AES_RX_Val         _U_(0x26)                                      /**< (XDMAC_CC) AES_RX  */
#define   XDMAC_CC_PERID_PWM1_Val           _U_(0x27)                                      /**< (XDMAC_CC) PWM1  */
#define   XDMAC_CC_PERID_TC0_Val            _U_(0x28)                                      /**< (XDMAC_CC) TC0  */
#define   XDMAC_CC_PERID_TC3_Val            _U_(0x29)                                      /**< (XDMAC_CC) TC3  */
#define   XDMAC_CC_PERID_TC6_Val            _U_(0x2A)                                      /**< (XDMAC_CC) TC6  */
#define   XDMAC_CC_PERID_TC9_Val            _U_(0x2B)                                      /**< (XDMAC_CC) TC9  */
#define   XDMAC_CC_PERID_I2SC0_TX_LEFT_Val  _U_(0x2C)                                      /**< (XDMAC_CC) I2SC0_TX_LEFT  */
#define   XDMAC_CC_PERID_I2SC0_RX_LEFT_Val  _U_(0x2D)                                      /**< (XDMAC_CC) I2SC0_RX_LEFT  */
#define   XDMAC_CC_PERID_I2SC1_TX_LEFT_Val  _U_(0x2E)                                      /**< (XDMAC_CC) I2SC1_TX_LEFT  */
#define   XDMAC_CC_PERID_I2SC1_RX_LEFT_Val  _U_(0x2F)                                      /**< (XDMAC_CC) I2SC1_RX_LEFT  */
#define   XDMAC_CC_PERID_I2SC0_TX_RIGHT_Val _U_(0x30)                                      /**< (XDMAC_CC) I2SC0_TX_RIGHT  */
#define   XDMAC_CC_PERID_I2SC0_RX_RIGHT_Val _U_(0x31)                                      /**< (XDMAC_CC) I2SC0_RX_RIGHT  */
#define   XDMAC_CC_PERID_I2SC1_TX_RIGHT_Val _U_(0x32)                                      /**< (XDMAC_CC) I2SC1_TX_RIGHT  */
#define   XDMAC_CC_PERID_I2SC1_RX_RIGHT_Val _U_(0x33)                                      /**< (XDMAC_CC) I2SC1_RX_RIGHT  */
#define XDMAC_CC_PERID_HSMCI                (XDMAC_CC_PERID_HSMCI_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) HSMCI Position  */
#define XDMAC_CC_PERID_SPI0_TX              (XDMAC_CC_PERID_SPI0_TX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) SPI0_TX Position  */
#define XDMAC_CC_PERID_SPI0_RX              (XDMAC_CC_PERID_SPI0_RX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) SPI0_RX Position  */
#define XDMAC_CC_PERID_SPI1_TX              (XDMAC_CC_PERID_SPI1_TX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) SPI1_TX Position  */
#define XDMAC_CC_PERID_SPI1_RX              (XDMAC_CC_PERID_SPI1_RX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) SPI1_RX Position  */
#define XDMAC_CC_PERID_QSPI_TX              (XDMAC_CC_PERID_QSPI_TX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) QSPI_TX Position  */
#define XDMAC_CC_PERID_QSPI_RX              (XDMAC_CC_PERID_QSPI_RX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) QSPI_RX Position  */
#define XDMAC_CC_PERID_USART0_TX            (XDMAC_CC_PERID_USART0_TX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) USART0_TX Position  */
#define XDMAC_CC_PERID_USART0_RX            (XDMAC_CC_PERID_USART0_RX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) USART0_RX Position  */
#define XDMAC_CC_PERID_USART1_TX            (XDMAC_CC_PERID_USART1_TX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) USART1_TX Position  */
#define XDMAC_CC_PERID_USART1_RX            (XDMAC_CC_PERID_USART1_RX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) USART1_RX Position  */
#define XDMAC_CC_PERID_USART2_TX            (XDMAC_CC_PERID_USART2_TX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) USART2_TX Position  */
#define XDMAC_CC_PERID_USART2_RX            (XDMAC_CC_PERID_USART2_RX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) USART2_RX Position  */
#define XDMAC_CC_PERID_PWM0                 (XDMAC_CC_PERID_PWM0_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) PWM0 Position  */
#define XDMAC_CC_PERID_TWIHS0_TX            (XDMAC_CC_PERID_TWIHS0_TX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) TWIHS0_TX Position  */
#define XDMAC_CC_PERID_TWIHS0_RX            (XDMAC_CC_PERID_TWIHS0_RX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) TWIHS0_RX Position  */
#define XDMAC_CC_PERID_TWIHS1_TX            (XDMAC_CC_PERID_TWIHS1_TX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) TWIHS1_TX Position  */
#define XDMAC_CC_PERID_TWIHS1_RX            (XDMAC_CC_PERID_TWIHS1_RX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) TWIHS1_RX Position  */
#define XDMAC_CC_PERID_TWIHS2_TX            (XDMAC_CC_PERID_TWIHS2_TX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) TWIHS2_TX Position  */
#define XDMAC_CC_PERID_TWIHS2_RX            (XDMAC_CC_PERID_TWIHS2_RX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) TWIHS2_RX Position  */
#define XDMAC_CC_PERID_UART0_TX             (XDMAC_CC_PERID_UART0_TX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) UART0_TX Position  */
#define XDMAC_CC_PERID_UART0_RX             (XDMAC_CC_PERID_UART0_RX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) UART0_RX Position  */
#define XDMAC_CC_PERID_UART1_TX             (XDMAC_CC_PERID_UART1_TX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) UART1_TX Position  */
#define XDMAC_CC_PERID_UART1_RX             (XDMAC_CC_PERID_UART1_RX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) UART1_RX Position  */
#define XDMAC_CC_PERID_UART2_TX             (XDMAC_CC_PERID_UART2_TX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) UART2_TX Position  */
#define XDMAC_CC_PERID_UART2_RX             (XDMAC_CC_PERID_UART2_RX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) UART2_RX Position  */
#define XDMAC_CC_PERID_UART3_TX             (XDMAC_CC_PERID_UART3_TX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) UART3_TX Position  */
#define XDMAC_CC_PERID_UART3_RX             (XDMAC_CC_PERID_UART3_RX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) UART3_RX Position  */
#define XDMAC_CC_PERID_UART4_TX             (XDMAC_CC_PERID_UART4_TX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) UART4_TX Position  */
#define XDMAC_CC_PERID_UART4_RX             (XDMAC_CC_PERID_UART4_RX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) UART4_RX Position  */
#define XDMAC_CC_PERID_DACC0                (XDMAC_CC_PERID_DACC0_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) DACC0 Position  */
#define XDMAC_CC_PERID_DACC1                (XDMAC_CC_PERID_DACC1_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) DACC1 Position  */
#define XDMAC_CC_PERID_SSC_TX               (XDMAC_CC_PERID_SSC_TX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) SSC_TX Position  */
#define XDMAC_CC_PERID_SSC_RX               (XDMAC_CC_PERID_SSC_RX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) SSC_RX Position  */
#define XDMAC_CC_PERID_PIOA                 (XDMAC_CC_PERID_PIOA_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) PIOA Position  */
#define XDMAC_CC_PERID_AFEC0                (XDMAC_CC_PERID_AFEC0_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) AFEC0 Position  */
#define XDMAC_CC_PERID_AFEC1                (XDMAC_CC_PERID_AFEC1_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) AFEC1 Position  */
#define XDMAC_CC_PERID_AES_TX               (XDMAC_CC_PERID_AES_TX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) AES_TX Position  */
#define XDMAC_CC_PERID_AES_RX               (XDMAC_CC_PERID_AES_RX_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) AES_RX Position  */
#define XDMAC_CC_PERID_PWM1                 (XDMAC_CC_PERID_PWM1_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) PWM1 Position  */
#define XDMAC_CC_PERID_TC0                  (XDMAC_CC_PERID_TC0_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) TC0 Position  */
#define XDMAC_CC_PERID_TC3                  (XDMAC_CC_PERID_TC3_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) TC3 Position  */
#define XDMAC_CC_PERID_TC6                  (XDMAC_CC_PERID_TC6_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) TC6 Position  */
#define XDMAC_CC_PERID_TC9                  (XDMAC_CC_PERID_TC9_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) TC9 Position  */
#define XDMAC_CC_PERID_I2SC0_TX_LEFT        (XDMAC_CC_PERID_I2SC0_TX_LEFT_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) I2SC0_TX_LEFT Position  */
#define XDMAC_CC_PERID_I2SC0_RX_LEFT        (XDMAC_CC_PERID_I2SC0_RX_LEFT_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) I2SC0_RX_LEFT Position  */
#define XDMAC_CC_PERID_I2SC1_TX_LEFT        (XDMAC_CC_PERID_I2SC1_TX_LEFT_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) I2SC1_TX_LEFT Position  */
#define XDMAC_CC_PERID_I2SC1_RX_LEFT        (XDMAC_CC_PERID_I2SC1_RX_LEFT_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) I2SC1_RX_LEFT Position  */
#define XDMAC_CC_PERID_I2SC0_TX_RIGHT       (XDMAC_CC_PERID_I2SC0_TX_RIGHT_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) I2SC0_TX_RIGHT Position  */
#define XDMAC_CC_PERID_I2SC0_RX_RIGHT       (XDMAC_CC_PERID_I2SC0_RX_RIGHT_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) I2SC0_RX_RIGHT Position  */
#define XDMAC_CC_PERID_I2SC1_TX_RIGHT       (XDMAC_CC_PERID_I2SC1_TX_RIGHT_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) I2SC1_TX_RIGHT Position  */
#define XDMAC_CC_PERID_I2SC1_RX_RIGHT       (XDMAC_CC_PERID_I2SC1_RX_RIGHT_Val << XDMAC_CC_PERID_Pos)  /**< (XDMAC_CC) I2SC1_RX_RIGHT Position  */
#define XDMAC_CC_MASK                       _U_(0x7FEF7FD7)                                /**< \deprecated (XDMAC_CC) Register MASK  (Use XDMAC_CC_Msk instead)  */
#define XDMAC_CC_Msk                        _U_(0x7FEF7FD7)                                /**< (XDMAC_CC) Register Mask  */


/* -------- XDMAC_CDS_MSP : (XDMAC Offset: 0x2c) (R/W 32) Channel Data Stride Memory Set Pattern -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t SDS_MSP:16;                /**< bit:  0..15  Channel x Source Data stride or Memory Set Pattern */
    uint32_t DDS_MSP:16;                /**< bit: 16..31  Channel x Destination Data Stride or Memory Set Pattern */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} XDMAC_CDS_MSP_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define XDMAC_CDS_MSP_OFFSET                (0x2C)                                        /**<  (XDMAC_CDS_MSP) Channel Data Stride Memory Set Pattern  Offset */

#define XDMAC_CDS_MSP_SDS_MSP_Pos           0                                              /**< (XDMAC_CDS_MSP) Channel x Source Data stride or Memory Set Pattern Position */
#define XDMAC_CDS_MSP_SDS_MSP_Msk           (_U_(0xFFFF) << XDMAC_CDS_MSP_SDS_MSP_Pos)     /**< (XDMAC_CDS_MSP) Channel x Source Data stride or Memory Set Pattern Mask */
#define XDMAC_CDS_MSP_SDS_MSP(value)        (XDMAC_CDS_MSP_SDS_MSP_Msk & ((value) << XDMAC_CDS_MSP_SDS_MSP_Pos))
#define XDMAC_CDS_MSP_DDS_MSP_Pos           16                                             /**< (XDMAC_CDS_MSP) Channel x Destination Data Stride or Memory Set Pattern Position */
#define XDMAC_CDS_MSP_DDS_MSP_Msk           (_U_(0xFFFF) << XDMAC_CDS_MSP_DDS_MSP_Pos)     /**< (XDMAC_CDS_MSP) Channel x Destination Data Stride or Memory Set Pattern Mask */
#define XDMAC_CDS_MSP_DDS_MSP(value)        (XDMAC_CDS_MSP_DDS_MSP_Msk & ((value) << XDMAC_CDS_MSP_DDS_MSP_Pos))
#define XDMAC_CDS_MSP_MASK                  _U_(0xFFFFFFFF)                                /**< \deprecated (XDMAC_CDS_MSP) Register MASK  (Use XDMAC_CDS_MSP_Msk instead)  */
#define XDMAC_CDS_MSP_Msk                   _U_(0xFFFFFFFF)                                /**< (XDMAC_CDS_MSP) Register Mask  */


/* -------- XDMAC_CSUS : (XDMAC Offset: 0x30) (R/W 32) Channel Source Microblock Stride -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t SUBS:24;                   /**< bit:  0..23  Channel x Source Microblock Stride       */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} XDMAC_CSUS_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define XDMAC_CSUS_OFFSET                   (0x30)                                        /**<  (XDMAC_CSUS) Channel Source Microblock Stride  Offset */

#define XDMAC_CSUS_SUBS_Pos                 0                                              /**< (XDMAC_CSUS) Channel x Source Microblock Stride Position */
#define XDMAC_CSUS_SUBS_Msk                 (_U_(0xFFFFFF) << XDMAC_CSUS_SUBS_Pos)         /**< (XDMAC_CSUS) Channel x Source Microblock Stride Mask */
#define XDMAC_CSUS_SUBS(value)              (XDMAC_CSUS_SUBS_Msk & ((value) << XDMAC_CSUS_SUBS_Pos))
#define XDMAC_CSUS_MASK                     _U_(0xFFFFFF)                                  /**< \deprecated (XDMAC_CSUS) Register MASK  (Use XDMAC_CSUS_Msk instead)  */
#define XDMAC_CSUS_Msk                      _U_(0xFFFFFF)                                  /**< (XDMAC_CSUS) Register Mask  */


